Сравнитель/src/Documents/СравнениеДанных/СравнениеДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СравнениеДанных</name>
  <registerRecords>InformationRegister.СравненияДанных</registerRecords>
  <attributes>
    <name>ПравилоСравненияДанных</name>
    <type>
      <types>CatalogRef.ПравилаСравненияДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВыгрузки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументаСравнениеДанных</types>
    </type>
  </attributes>
</mdclass:Document>

Сравнитель/src/Documents/СравнениеДанных/ManagerModule.bsl
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" И Не ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Ключ")) Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "Документ.СравнениеДанных.Форма.ФормаИмпортаВыгрузки";
	КонецЕсли;
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Формирует таблицы движений для документа
//
// Параметры:
//  Ссылка - ДокументСсылка.СравнениеДанных -
//
// Возвращаемое значение:
//  Структура из ТаблицаЗначений - Структура, ключи которой соответствуют имени регистра,
//   а значения содержат готовые таблицы движений
Функция ДанныеДляПроведенияДокумента(Ссылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СравнениеДанных.ИдентификаторВыгрузки КАК ИдентификаторВыгрузки,
		|	СравнениеДанных.Статус КАК Статус
		|ИЗ
		|	Документ.СравнениеДанных КАК СравнениеДанных
		|ГДЕ
		|	СравнениеДанных.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Новый Структура("СравненияДанных", РезультатЗапроса.Выгрузить());
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
